package com.example.campusapp.data;


import com.example.campusapp.model.LocationItem;
import java.util.ArrayList;
import java.util.List;

public class LocationRepository {

    private static final List<LocationItem> locations = new ArrayList<>();

    static {
        locations.add(new LocationItem(
                1,
                "ФЕИТ Библиотека",
                "Библиотека",
                "Библиотеката функционира како посебна работна единица, заедничка за Факултетот за електротехника и информациски технологии и Машинскиот факултет. Постои од формирањето на факултетите и бележи постојан подем во своето работење, вбројуваќи се, во моментов, во редот на најуспешните високошколски библиотеки во земјава. Библиотеката работи според важечките меѓународни библиотечни стандарди, а воведeна е и компјутеризација на сите работни процеси во библиотеката, со што таа претставува и современа информативно-документаристичка служба.",
                "ул. „Руѓер Бошковиќ“ бр. 18",
                "(02) 3099 188",
                42.00509036373351,
                21.408493621686905
        ));

        locations.add(new LocationItem(
                2,
                "ФЕИТ Кантина",
                "Кантина",
                "Студентската кантина на ФЕИТ со одлични цени.",
                "ул. „Руѓер Бошковиќ“ бр. 18",
                "078 270 140",
                42.00518096988644,
                21.408102233605312
        ));

        locations.add(new LocationItem(
                3,
                "ФЕИТ КТИ Лабораторија",
                "Лабораторија",
                "Почетоците на Лабораторијата за компјутерски технологии и инженерство, датираат од почетоците на формирањето на Институтот како Лабораторија за компјутерска техника и информатика. Подоцна со окрупнувањето на Институтот, лабораториските активности од областите на КТИ се пренесуваат во Факултетскиот центар за обработка на податоци (ФЛАОП). Сепак, заради специфичностите на областите кои се негуваат на Институтот за КТИ и развојот во последните години, од 2019. година започнува да функционира нова и специјализирана лабораторија за наставна, научно – истражувачка и апликативна дејност.",
                "ул. „Руѓер Бошковиќ“ бр. 18",
                "",
                42.00457764436129,
                21.407724128811065
        ));
        locations.add(new LocationItem(
                4,
                "ФЛАОП Лабораторија",
                "Лабораторија",
                "Првиот сметачки центар на тогашниот Електро – машински факултет во Скопје е формиран пред повеќе од педесет години, кога во 1968. година е купена првата сметачка машина IBM 1130. Воедно, тоа е прв сметач од ваков вид во Македонија и трет во тогашната Југославија. Прв раководител на сметачкиот центар е проф. д-р Момчило Богданов. ",
                "ул. „Руѓер Бошковиќ“ бр. 18",
                "",
                42.00509790986284,
                21.408363177029052

        ));
        locations.add(new LocationItem(
                5,
                "ФЕИТ Студентска Служба",
                "Служба",
                "Студентската служба на ФЕИТ.",
                "ул. „Руѓер Бошковиќ“ бр. 18",
                "(02) 3099 199",
                42.005049760022935,
                21.408440203492006
        ));
        locations.add(new LocationItem(
                6,
                "ФЕИТ Амфитеатар",
                "Амфитеатар",
                "Амфитеатарот на ФЕИТ.",
                "ул. „Руѓер Бошковиќ“ бр. 18",
                "",
                42.00512889673979,
                21.408044354406854
        ));
        locations.add(new LocationItem(
                7,
                "Градежен Факултет Амфитеатар",
                "Амфитеатар",
                "Амфитеатарот на Градежен Факултет.",
                "бул. „Партизански одреди“ бр. 24",
                "",
                41.99999786741441,
                21.419403877141544
        ));
        locations.add(new LocationItem(
                8,
                "Градежен Факултет Библиотека",
                "Библиотека",
                "Библиотеката е формирана со формирањето на Техничкиот факултет во 1949 год. а самостојно, како посебна работна единица, работи од 1975 год. Во целиот овој период од формирањето до денес нејзината дејност постојано се зголемува и осовременува.Библиотеката врши набавка на различни видови библиотечен материјал (книги, учебници, списанија, стандарди) во согласност со потребите на корисниците, го средува и каталогизира тој материјал, правејки го брзо достапен на корисниците. Книжниот фонд се состои од учебници, странска и домашна стручна литература, списанија и стандарди. Библиотеката располага со над 16.000 наслови што ја прави да биде една од најдобро снабдените библиотеки имајќи во предвид дека се работи за библиотека од затворен тип. Во овој број не се вклучени магистерските и докторските работи одбранети на Градежниот факултет како и соопштенија од одржани симпозиуми и семинари.",
                "бул. „Партизански одреди“ бр. 24",
                "magdalena@gf.ukim.edu.mk",
                42.00016632709316,
                21.419300040722657
        ));
        locations.add(new LocationItem(
                9,
                "Градежен Факултет Лабораторија за геотехника",
                "Лабораторија",
                "Последната фаза на развој на лабораторијата е поврзана со добивањето на донација од страна на Владата на СР.Германија во 1997 година, кога постојнатае дополнета со најсовремена опрема за теренски и лабораториски комплексни геотехнички истражувања и испитувања. Со оваа трета фаза во развојот на катедрата, таа со лабораториската и теренската опременост со право се вбројува во најопремените геотехнички центри не само на Балканот, туку и во Југоисточна Европа..",
                "бул. „Партизански одреди“ бр. 24",
                "",
                41.99989461771344,
                21.418815958262794
        ));
        locations.add(new LocationItem(
                10,
                "Градежен Факултет Лабораторија за бетон и конструкции",
                "Лабораторија",
                "Во рамките на катедрата за бетон и конструкции постои и функционира Лабораторијата за бетон и конструкции. Формирана е со цел да се овозмопрактична настава за студентите по дисциплините од Катедрата како што се: Технологија на бетонот, армиран бетон, преднапрегнат бетон, мостови армиранобетонски конструкции и дрвени конструкции. Лабораторијата е снабдена со инструменти и опрема потребни за извршување на испитувања на бетонот и составните материјали: цементот, агрегатот, водата и адитивите. Во лабораторијата студентите се запознаваат со начинот и постапката за испитување на споменатите материјали, како и за испитувањето на арматурата за армиранобетонските конструкции, арматурата за преднапрегање и дрвото како материјал за дрвените конструкции.",
                "бул. „Партизански одреди“ бр. 24",
                "",
                42.00036863792631,
                21.418115771921933
        ));
        locations.add(new LocationItem(
                11,
                "Градежен Факултет Студентска Служба",
                "Служба",
                "Студентската служба на Градежен Факултет.",
                "бул. „Партизански одреди“ бр. 24",
                "sekretar@gf.ukim.edu.mk",
                41.99999880226571,
                21.419145113724195
        ));
        locations.add(new LocationItem(
                12,
                "Медицински Факултет Амфитеатар",
                "Амфитеатар",
                "Амфитеатарот на Медицински Факултет.",
                "ул. „50 Дивизија“ бр. 6",
                "",
                41.98953649591987,
                21.42412336734769
        ));
        locations.add(new LocationItem(
                13,
                "Медицински Факултет Библиотека",
                "Библиотека",
                "Библиотека на Медицински Факултет.",
                "ул. „50 Дивизија“ бр. 6",
                "",
                41.98955892388713,
                21.424247419506745
        ));
        locations.add(new LocationItem(
                14,
                "Медицински Факултет Лабораторија за биохемиски испитувања",
                "Лабораторија",
                "Лабораторијата за биохемиски испитувања (ЛБИ) која е составен дел на Институтот за медицинска и експериментална биохемија при Медицински факултет-Скопје е акредитирана од Институтот за акредитација на Република Македонија. Раководител на ЛБИ е доц.д-р Светлана Цековска.",
                "ул. „50 Дивизија“ бр. 6",
                "",
                41.989625210944126,
                21.42412001458663
        ));
        locations.add(new LocationItem(
                15,
                "Медицински Факултет Лабораторија за биохемиски испитувања",
                "Лабораторија",
        "Во лабораторијата за молекуларни испитувања постојано се врши детекција на патогени микроорганизми од примероци на пациенти од Универзитетските клиники при Медицинскиот факултет, но и од приватните клинички болници: докажување на HPV и негова типизација, детекција на микроорганизми во крв при септични состојби (цела палета на бактерии и некои фунги), вклучувајќи и одредување на одредени гени на резистенција (mecA ген, vanА ген) итн.",
        "ул. „50 Дивизија“ бр. 6",
                "",
                41.98956490467706,
                21.42403619556024
        ));
        locations.add(new LocationItem(
                16,
                "Медицински Факултет Студентска Служба",
                "Служба",
                "Студентската служба на Медицински Факултет.",
                "ул. „50 Дивизија“ бр. 6",
                "(02) 3103 706",
                41.98955742868955,
                21.424293687609318
        ));
    }
        public static List<LocationItem> getLocations() {
            return locations;
        }

        public static LocationItem getById(int id) {
            for (LocationItem l : locations) {
                if (l.getId() == id) return l;
            }
            return null;
        }
    }